#hello world

In [2]:
from IPython.display import IFrame 
agelink="https://www.cia.gov/the-world-factbook/field/median-age/country-comparison"
IFrame(agelink, width=900, height=500)

In [15]:
import pandas as pd
agetable=pd.read_html(agelink, header=0, flavor='bs4')
agetable[0].head()

   Rank                    Country  years Date of Information
0     1                     Monaco   55.4                 NaN
1     2                      Japan   48.6                 NaN
2     3  Saint Pierre and Miquelon   48.5                 NaN
3     4                    Germany   47.8                 NaN
4     5                      Italy   46.5                 NaN

In [5]:
agetable

[     Rank                    Country  years Date of Information
 0       1                     Monaco   55.4                 NaN
 1       2                      Japan   48.6                 NaN
 2       3  Saint Pierre and Miquelon   48.5                 NaN
 3       4                    Germany   47.8                 NaN
 4       5                      Italy   46.5                 NaN
 ..    ...                        ...    ...                 ...
 222   223                       Chad   16.1                 NaN
 223   224                       Mali   16.0                 NaN
 224   225                     Angola   15.9                 NaN
 225   226                     Uganda   15.7                 NaN
 226   227                      Niger   14.8                 NaN

 [227 rows x 4 columns]]

In [21]:
DFage=agetable[0].copy()

In [22]:
DFage.columns

Index(['Rank', 'Country', 'years', 'Date of Information'], dtype='object')

In [23]:
bye=[3]
DFage.drop(columns=DFage.columns[bye],inplace=True)#inplace!!
DFage

     Rank                    Country  years
0       1                     Monaco   55.4
1       2                      Japan   48.6
2       3  Saint Pierre and Miquelon   48.5
3       4                    Germany   47.8
4       5                      Italy   46.5
..    ...                        ...    ...
222   223                       Chad   16.1
223   224                       Mali   16.0
224   225                     Angola   15.9
225   226                     Uganda   15.7
226   227                      Niger   14.8

[227 rows x 3 columns]

In [24]:
DFage.columns.to_list()

['Rank', 'Country', 'years']

In [27]:
DFage.columns.str.replace(pat="\W",repl="",regex=True)

Index(['Rank', 'Country', 'years'], dtype='object')

In [28]:
DFage.columns.str.replace("\W","",regex=True).to_list()

['Rank', 'Country', 'years']

In [29]:
DFage.columns=DFage.columns.str.replace("\W","",regex=True).to_list()

In [30]:
DFage.iloc[:,:2]

     Rank                    Country
0       1                     Monaco
1       2                      Japan
2       3  Saint Pierre and Miquelon
3       4                    Germany
4       5                      Italy
..    ...                        ...
222   223                       Chad
223   224                       Mali
224   225                     Angola
225   226                     Uganda
226   227                      Niger

[227 rows x 2 columns]

In [34]:
DFage.Country.str.strip()

0                         Monaco
1                          Japan
2      Saint Pierre and Miquelon
3                        Germany
4                          Italy
                 ...
222                         Chad
223                         Mali
224                       Angola
225                       Uganda
226                        Niger
Name: Country, Length: 227, dtype: object

In [37]:
DFage.columns.str.capitalize()

Index(['Rank', 'Country', 'Years'], dtype='object')

In [39]:
DFage.columns=DFage.columns.str.capitalize()

In [44]:
from IPython.display import IFrame
poplink="https://www.cia.gov/the-world-factbook/field/population/country-comparison"
IFrame(agelink, width=900, height=500)

In [45]:
poptable=pd.read_html(poplink, header=0)
poptable[0].head()

   Rank        Country  Unnamed: 2 Date of Information
0     1          China  1410539758           2022 est.
1     2          India  1389637446           2022 est.
2     3  United States   337341954           2022 est.
3     4      Indonesia   277329163           2022 est.
4     5       Pakistan   242923845           2022 est.

In [46]:
DFpop=poptable[0].copy()

In [48]:
bye=[3]
DFpop.drop(columns=DFpop.columns[bye],inplace=True)
DFpop

     Rank                  Country    Unnamed2
0       1                    China  1410539758
1       2                    India  1389637446
2       3            United States   337341954
3       4                Indonesia   277329163
4       5                 Pakistan   242923845
..    ...                      ...         ...
232   233                  Tokelau        1647
233   234          Paracel Islands        1440
234   235  Holy See (Vatican City)        1000
235   236  Cocos (Keeling) Islands         596
236   237         Pitcairn Islands          50

[237 rows x 3 columns]

In [69]:
DFpop.columns.str.replace(pat="Unnamed2",repl="population", regex=True)

Index(['Rank', 'Country', 'Population'], dtype='object')

In [70]:
DFpop.columns=DFpop.columns.str.replace("Unnamed2","Population",regex=True).to_list()

In [71]:
DFpop

     Rank                  Country  Population
0       1                    China  1410539758
1       2                    India  1389637446
2       3            United States   337341954
3       4                Indonesia   277329163
4       5                 Pakistan   242923845
..    ...                      ...         ...
232   233                  Tokelau        1647
233   234          Paracel Islands        1440
234   235  Holy See (Vatican City)        1000
235   236  Cocos (Keeling) Islands         596
236   237         Pitcairn Islands          50

[237 rows x 3 columns]

In [72]:
DFpop.Country.str.strip()

0                        China
1                        India
2                United States
3                    Indonesia
4                     Pakistan
                ...
232                    Tokelau
233            Paracel Islands
234    Holy See (Vatican City)
235    Cocos (Keeling) Islands
236           Pitcairn Islands
Name: Country, Length: 237, dtype: object